In [1]:
#import libraries
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
#import train data
train_data = pd.read_csv("train.csv")
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
#import test data
test_data = pd.read_csv("test.csv")
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
#check missing values in train
train_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
#check missing values in test
test_data.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [6]:
#drop unwanted column
# train_data_X = train_data.drop(["Survived", "Name", "Cabin", "Ticket"], axis = 1)
train_data_X = train_data.drop(["Survived", "Name", "Cabin", "Ticket", "PassengerId"], axis = 1)

train_data_y = train_data["Survived"]
# test_data_X = test_data.drop(["Name", "Cabin", "Ticket"], axis = 1)
test_data_X = test_data.drop(["Name", "Cabin", "Ticket", "PassengerId"], axis = 1)

In [7]:
#check data types
train_data_X.info(), test_data_X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Sex       891 non-null    object
 2   Age       714 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
 6   Embarked  889 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 48.9+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       332 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      417 non-null    float64
 6   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 23.0+ KB

(None, None)

In [8]:
#ignore
train_data_X

     Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         3    male  22.0      1      0   7.2500        S
1         1  female  38.0      1      0  71.2833        C
2         3  female  26.0      0      0   7.9250        S
3         1  female  35.0      1      0  53.1000        S
4         3    male  35.0      0      0   8.0500        S
..      ...     ...   ...    ...    ...      ...      ...
886       2    male  27.0      0      0  13.0000        S
887       1  female  19.0      0      0  30.0000        S
888       3  female   NaN      1      2  23.4500        S
889       1    male  26.0      0      0  30.0000        C
890       3    male  32.0      0      0   7.7500        Q

[891 rows x 7 columns]

In [9]:
#check missing values
train_data_X.isnull().sum(), test_data_X.isnull().sum()

(Pclass        0
 Sex           0
 Age         177
 SibSp         0
 Parch         0
 Fare          0
 Embarked      2
 dtype: int64,
 Pclass       0
 Sex          0
 Age         86
 SibSp        0
 Parch        0
 Fare         1
 Embarked     0
 dtype: int64)

In [10]:
#most frequent values

train_data_X['Embarked'].value_counts(), test_data_X['Fare'].value_counts()

(S    644
 C    168
 Q     77
 Name: Embarked, dtype: int64,
 7.7500     21
 26.0000    19
 8.0500     17
 13.0000    17
 7.8958     11
            ..
 9.3250      1
 14.4583     1
 15.0333     1
 25.4667     1
 21.0750     1
 Name: Fare, Length: 169, dtype: int64)

In [11]:
#fill the missing values with most frequent for embarked and Fare 
#fill the missing values with mean for age

train_data_X["Age"].fillna(value = train_data_X["Age"].mean(), inplace = True)
train_data_X["Embarked"].fillna(value = 'S', inplace = True)


test_data_X["Age"].fillna(value = test_data_X["Age"].mean(), inplace = True)
test_data_X["Fare"].fillna(value = 7.7500, inplace = True)


#unskew the fare
train_data_X["Fare"] = train_data_X["Fare"].map(lambda i: np.log(i) if i > 0 else 0)
test_data_X["Fare"] = test_data_X["Fare"].map(lambda i: np.log(i) if i > 0 else 0)

In [12]:
#checl if any missing values
train_data_X.isnull().sum(), test_data_X.isnull().sum()

(Pclass      0
 Sex         0
 Age         0
 SibSp       0
 Parch       0
 Fare        0
 Embarked    0
 dtype: int64,
 Pclass      0
 Sex         0
 Age         0
 SibSp       0
 Parch       0
 Fare        0
 Embarked    0
 dtype: int64)

In [13]:
test_data_X.info(), train_data_X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       418 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      418 non-null    float64
 6   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 23.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Sex       891 non-null    object
 2   Age       891 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
 6   Embarked  891 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 48.9+ KB

(None, None)

In [14]:
#Encoding the data with one hot encoder

# from sklearn.preprocessing import OneHotEncoder
# from sklearn.composep import ColumnTransform
# train_data_X_processed = OneHotEncoder().fit(train_data_X)
# train_data_X_processed

In [15]:
#Emcoding the data from Label Encoder
from sklearn.preprocessing import LabelEncoder

train_data_X["Sex"] = LabelEncoder().fit_transform(train_data_X["Sex"])
train_data_X["Embarked"] = LabelEncoder().fit_transform(train_data_X["Embarked"])

test_data_X["Sex"] = LabelEncoder().fit_transform(test_data_X["Sex"])
test_data_X["Embarked"] = LabelEncoder().fit_transform(test_data_X["Embarked"])

In [16]:
train_data_X.info(), test_data_X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Sex       891 non-null    int32
 2   Age       891 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
 6   Embarked  891 non-null    int32
dtypes: float64(2), int32(2), int64(3)
memory usage: 41.9 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    int32
 2   Age       418 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      418 non-null    float64
 6   Embarked  418 non-null    int32
dtypes: float64(2), int32(2), int64(3)
memory usage: 19.7 KB

(None, None)

In [17]:
#import splitter 
from sklearn.model_selection import train_test_split

#split the training data
X_train_1, X_train_2, y_train_1, y_train_2 = train_test_split(train_data_X, train_data_y)

In [18]:
#training and scoring the model
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn.svm import SVR, LinearSVC, SVC
from sklearn.linear_model import Ridge


# clf = {"RandomForestClassifier" : RandomForestClassifier(),
#       "LogisticRegression" : LogisticRegression(),
#       "KNeighborsClassifier" : KNeighborsClassifier(),
#       "SVR" : SVR(),
#       "SVC" : SVC(),
#       "LinerSVC" : LinearSVC(),
#       "Ridge" : Ridge()}

# results = {}

# #training the data

# for model_name, model in clf.items():
#     model.fit(X_train_1, y_train_1)
#     results[model_name] = model.score(X_train_2, y_train_2)
    
# results

# {'RandomForestClassifier': 0.7892376681614349,
#  'LogisticRegression': 0.7713004484304933,
#  'KNeighborsClassifier': 0.5874439461883408,
#  'SVR': -0.16539855167315176,
#  'SVC': 0.6278026905829597,
#  'LinerSVC': 0.6816143497757847,
#  'Ridge': 0.406937445106912}

clf = RandomForestClassifier()

clf.fit(X_train_1, y_train_1)
clf.score(X_train_2, y_train_2)

0.8116591928251121

In [20]:
test_data_output = test_data["PassengerId"]
test_data_output = pd.DataFrame(test_data_output, columns=["PassengerId"])
test_data_output

     PassengerId
0            892
1            893
2            894
3            895
4            896
..           ...
413         1305
414         1306
415         1307
416         1308
417         1309

[418 rows x 1 columns]

In [21]:
#output format
sample_result = pd.read_csv("gender_submission.csv")
sample_result

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [22]:
#creating the output
test_data_output["Survived"] = clf.predict(test_data_X)
test_data_output

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         1
4            896         0
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [23]:
#exporting the data
test_data_output.to_csv("test_data_output4.csv", index = False)

In [ ]:
plt.plot()